In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('./salaries.csv')
print(df)

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [4]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [5]:
print(df[['Salary','Name']])

   Salary    Name
0   50000    John
1  120000   Sally
2   80000  Alyssa

In [6]:
df['Salary'].mean()

83333.33333333333

In [7]:
df['Salary'].max()

120000

In [8]:
df['Age']>30

0     True
1     True
2    False
Name: Age, dtype: bool

In [9]:
ser_of_bool=df['Age']>30
df[ser_of_bool]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [10]:
df[[False,True,True]]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27

In [11]:
df['Age'].unique()

array([34, 45, 27])

In [14]:
df['Age'].nunique()

3

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Salary  3 non-null      int64
 2   Age     3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [17]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000

In [23]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
df.loc[1]

Name       Sally
Salary    120000
Age           45
Name: 1, dtype: object

# PANDAS TOGETHER WITH NUMPY

In [24]:
import numpy as np

In [34]:
mat=np.arange(0,10).reshape(5,2)

In [38]:
df=pd.DataFrame(data=mat, columns=['A','B'])
print(df)

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

# EXERCSIZES

https://github.com/Pierian-Data/Plotly-Dashboards-with-Dash/tree/master/0-03-Crash-Course-Exercises

In [39]:
import pandas as pd
import numpy as np

In [40]:
np.random.seed(101)

In [42]:
mat=np.random.randint(1,100,(100,5))

In [43]:
df = pd.DataFrame(mat)

In [45]:
df.columns = ['f1','f2','f3','f4','label']